[{"title":"Vim Tutor Summary","date":"2018-12-02T10:11:34.817Z","path":"2018/12/02/Vim-Tutor-Summary/","text":"Lesson 11.1 Moving the cursor type h j k l to move cursor as left up down right 1.2 Exiting Vim type :q! &lt;Enter&gt; 1.3 Text Editing - Deletion type x to delete the character under the cursor 1.4 Text Editing - Insertion type i to insert text in front of the cursortype Shirt + i insert text at the beginning of line 1.5 Text Editing - Appending type a to append text in back of the cursortype Shirt + a to append text at the end of line 1.6 Editing a File type :wq to save file with changes and exit Lesson 22.1 Deletion Commands type dw to delete a wordtype de will delete from the cursor to the end of the word 2.2 More Deletion Commands type d$ to delete to the end of the line 2.3 On Operators And Motions Many commands that change text are made from an operator and a motionThe format for a delete command with the d delete operator is as follows: d motion Where: d - is the delete operator motion - is what the operator will operate on (listed below) 2.4 Using a Count For a Motion typing a number before a motion repeats it that many timestype 2w to move the cursor two words forward 2.5 Using a count todelete more typing a number with an operator repeats it that many timesd number motion 2.6 Operating On Lines type dd to delete a whole linetpye 0 to move to the start of the linetpye $ to move to the end of the line 2.7 The Undo Command type u to undo undo previous actionstype Shirt + u to undo all the changes on a linetype Ctrl + r to undo the undo’s Lesson 33.1 The Put Command type dd to delete the line and store it in a Vim registertype p to put the line below the cursor 3.2 The Replace Command type r and then the character which should be there 3.3 The Change Operator type ce to deletes the word and places you in Insert modetype &lt;Esc&gt; and move to the next character that needs to be changed 3.4 More Changes Using c The change operator is used with the same motions as deletec [number] motion Lesson 44.2 Search command type /xxxtype n to search nexttype N to search previous 4.3 Matching brackets type % 4.4 The Substitute Command type :s/old/new/g to substitute new for old,all occurrences in the line will be changed.type #,#s/old/new/g,#are the line numberstype %s/old/new/g to change every occurence in the whole file Lesson 55.1 How to execute an external command type :!xxx 5.2 More on writing files type w FILENAME to write a same filetype !rm FILENAME to remove the file 5.3 Selecting text to write type v and move the cursor to select texttype w FILENAME to write a new file Lesson 66.1 The open command type o to open up a line below the cursor and place you in Insert mode.type Shirt + o to open up a line above the cursor and place you in Insert mode. 6.2 The append command type a to insert text after the cursor.type Shirt + a to insert text after the line. 6.3 Another way to replace type Shirt + r to replace more than one character.type &lt;ESC&gt; to leave Replace mode. 6.4 Copy and Paste text type y to copy texttype v to start visual mode,and move the cursor,then type y copy texttype yw to copy a wordtype p to paste it Lesson 77.1 Create a startup script type e ~/.config/nvim/init.vim to start editing the vimrc file.","tags":[{"name":"Tutor","slug":"Tutor","permalink":"http://yoursite.com/tags/Tutor/"}]}]